# ==============================================================================
# configs/model.yaml -- YOLOv8n-P2 Custom Architecture
# The Aerial Guardian MOT Pipeline
# ==============================================================================
#
# WHY P2?
# Standard YOLOv8n detects at strides [8, 16, 32]. At imgsz=1280, the
# smallest anchor grid is 1280/8 = 160x90 cells. A 12x28px person occupies
# ~1.5x3.5 cells -- marginal, often missed.
#
# Adding a stride-4 (P2) head produces a 320x180 detection grid. That same
# 12x28px person covers ~3x7 cells -- well above the detection threshold.
# This replaces SAHI: one forward pass, zero slicing overhead.
#
# ARCHITECTURE OVERVIEW (nano scale):
# Backbone (layers 0-9):  Standard YOLOv8n feature extractor
# Head    (layers 10-28): 4-scale FPN+PAN with P2 added at top of pyramid
#
# LAYER INDEX MAP:
#  Backbone: 0(P1) -> 1(P2) -> 2(P2-feat) -> 3(P3) -> 4(P3-feat)
#            -> 5(P4) -> 6(P4-feat) -> 7(P5) -> 8(P5-feat) -> 9(SPPF)
#  Head FPN: 10->11->12(P4-fused) -> 13->14->15(P3-fused) -> 16->17->18(P2-fused)
#  Head PAN: 19->20->21(P3-det) -> 22->23->24(P4-det) -> 25->26->27(P5-det)
#  Detect:   28 -- [P2(18), P3(21), P4(24), P5(27)]
# ==============================================================================

# One class only: Person (VisDrone category 1 / pedestrian)
nc: 1

# Nano-scale compound coefficients:
#   depth_multiple = 0.33  -> C2f repeat counts multiplied by this
#   width_multiple = 0.25  -> channel counts multiplied by this
#   max_channels   = 1024  -> channel cap
# Effective channels after scaling:
#   P2: 32  P3: 64  P4: 128  P5: 256
scales:
  n: [0.33, 0.25, 1024]

# ==============================================================================
# BACKBONE -- Standard YOLOv8n feature extractor (layers 0-9)
# Format: [from, repeats, module, args]
# ==============================================================================
backbone:
  # Layer 0: stem 3->64ch, stride 2 -> P1/2
  - [-1, 1, Conv, [64, 3, 2]]

  # Layer 1: 64->128ch, stride 2 -> P2/4
  - [-1, 1, Conv, [128, 3, 2]]

  # Layer 2: P2 feature block (stride 4) -- tapped at index 2 in FPN
  - [-1, 3, C2f, [128, True]]

  # Layer 3: 128->256ch, stride 2 -> P3/8
  - [-1, 1, Conv, [256, 3, 2]]

  # Layer 4: P3 feature block (stride 8) -- tapped at index 4 in FPN
  - [-1, 6, C2f, [256, True]]

  # Layer 5: 256->512ch, stride 2 -> P4/16
  - [-1, 1, Conv, [512, 3, 2]]

  # Layer 6: P4 feature block (stride 16) -- tapped at index 6 in FPN
  - [-1, 6, C2f, [512, True]]

  # Layer 7: 512->1024ch, stride 2 -> P5/32
  - [-1, 1, Conv, [1024, 3, 2]]

  # Layer 8: P5 feature block (stride 32)
  - [-1, 3, C2f, [1024, True]]

  # Layer 9: SPPF -- aggregates global context at P5
  - [-1, 1, SPPF, [1024, 5]]

# ==============================================================================
# HEAD -- 4-Scale FPN + PAN with P2 detection head (layers 10-28)
#
# FPN (top-down): fuses high-level semantics DOWN to finer spatial detail
#   P5(9) -> fused-P4(12) -> fused-P3(15) -> fused-P2(18)  <- NEW P2 branch
#
# PAN (bottom-up): re-fuses spatial detail UP for precise localisation
#   fused-P2(18) -> P3-det(21) -> P4-det(24) -> P5-det(27)
# ==============================================================================
head:
  # --- FPN: P5 -> P4 ---
  # Layer 10: upsample P5 x2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # Layer 11: concat with backbone P4 (layer 6)
  - [[-1, 6], 1, Concat, [1]]
  # Layer 12: fused P4 -- 512ch
  - [-1, 3, C2f, [512]]

  # --- FPN: P4 -> P3 ---
  # Layer 13: upsample fused-P4 x2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # Layer 14: concat with backbone P3 (layer 4)
  - [[-1, 4], 1, Concat, [1]]
  # Layer 15: fused P3 -- 256ch
  - [-1, 3, C2f, [256]]

  # --- FPN: P3 -> P2 [NEW -- not in standard YOLOv8] ---
  # Layer 16: upsample fused-P3 x2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # Layer 17: concat with backbone P2 (layer 2)
  - [[-1, 2], 1, Concat, [1]]
  # Layer 18: fused P2 -- 128ch @ stride 4
  # At imgsz=1280 this is a 320x180 detection grid.
  # *** THIS IS THE NEW P2 DETECTION HEAD ***
  - [-1, 3, C2f, [128]]

  # --- PAN: P2 -> P3 ---
  # Layer 19: downsample fused-P2 to P3 resolution
  - [-1, 1, Conv, [128, 3, 2]]
  # Layer 20: concat with fused-P3 (layer 15)
  - [[-1, 15], 1, Concat, [1]]
  # Layer 21: P3 detect feature -- 256ch @ stride 8
  - [-1, 3, C2f, [256]]

  # --- PAN: P3 -> P4 ---
  # Layer 22: downsample P3-det to P4 resolution
  - [-1, 1, Conv, [256, 3, 2]]
  # Layer 23: concat with fused-P4 (layer 12)
  - [[-1, 12], 1, Concat, [1]]
  # Layer 24: P4 detect feature -- 512ch @ stride 16
  - [-1, 3, C2f, [512]]

  # --- PAN: P4 -> P5 ---
  # Layer 25: downsample P4-det to P5 resolution
  - [-1, 1, Conv, [512, 3, 2]]
  # Layer 26: concat with SPPF output (layer 9)
  - [[-1, 9], 1, Concat, [1]]
  # Layer 27: P5 detect feature -- 1024ch @ stride 32
  - [-1, 3, C2f, [1024]]

  # Layer 28: Detect from all 4 scales
  # Anchor grids at imgsz=1280:
  #   P2(18): 320x180 -- catches  8-16px targets  <- key for drone footage
  #   P3(21): 160x90  -- catches 16-48px targets
  #   P4(24):  80x45  -- catches 48-96px targets
  #   P5(27):  40x23  -- catches 96px+ targets
  - [[18, 21, 24, 27], 1, Detect, [nc]]
